Revit 2026 API

# InitialLuminousIntensity(InitialLuminousIntensity) Constructor

---

Creates a copy of the given initial luminous intensity object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InitialLuminousIntensity(
	InitialLuminousIntensity other
)
```
```vb
Public Sub New (
	other As InitialLuminousIntensity
)
```
```cpp
public:
InitialLuminousIntensity(
	InitialLuminousIntensity^ other
)
```
```fsharp
new :
        other : InitialLuminousIntensity -> InitialLuminousIntensity
```

#### Parameters

other InitialLuminousIntensity

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

InitialLuminousIntensity Class

InitialLuminousIntensity Overload

Autodesk.Revit.DB.Lighting Namespace